In [ ]:
import yfinance as yf
import pandas as pd

all_data = {ticker:yf.download(ticker) for ticker in ['2330.TW','2303.TW','2454.TW','2317.TW']}
all_data

In [4]:
new_data = {key:df[('Adj Close', key)] for key,df in all_data.items()}
df = pd.DataFrame(new_data)
df1 = df.rename(columns={
    '2330.TW':'台積電',
    '2303.TW':'聯電',
    '2454.TW':'聯發科',
    '2317.TW':'鴻海'
})
df1

               台積電         聯電     聯發科          鴻海
Date
1993-01-05     NaN        NaN     NaN    0.399521
1993-01-06     NaN        NaN     NaN    0.392806
1993-01-07     NaN        NaN     NaN    0.391128
1993-01-08     NaN        NaN     NaN    0.379377
1993-01-11     NaN        NaN     NaN    0.381895
...            ...        ...     ...         ...
2024-12-13  1065.0  41.450001  1410.0  186.500000
2024-12-16  1085.0  41.450001  1385.0  182.000000
2024-12-17  1075.0  42.549999  1425.0  183.000000
2024-12-18  1085.0  43.700001  1420.0  184.500000
2024-12-19  1070.0  43.000000  1420.0  181.000000

[8044 rows x 4 columns]

In [7]:
df2 = df1.dropna()

In [8]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5815 entries, 2001-07-23 to 2024-12-19
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   台積電     5815 non-null   float64
 1   聯電      5815 non-null   float64
 2   聯發科     5815 non-null   float64
 3   鴻海      5815 non-null   float64
dtypes: float64(4)
memory usage: 227.1 KB

In [ ]:
df2

In [12]:
df3 = df2.pct_change().dropna()

In [13]:
df3.corr()

          台積電        聯電       聯發科        鴻海
台積電  1.000000  0.599523  0.434737  0.487236
聯電   0.599523  1.000000  0.377358  0.424866
聯發科  0.434737  0.377358  1.000000  0.372232
鴻海   0.487236  0.424866  0.372232  1.000000